# Chapter 10: Data Aggregation and Group Operations

In [1]:
import numpy as np
import pandas as pd

## 10.1: How to Think About Group Operations

In [2]:
df=pd.DataFrame({"key1":["a","a",None,"b","b","a",None],
                 "key2":pd.Series([1,2,1,2,1,None,1],dtype="Int64"),
                 "data1":np.random.standard_normal(7),
                 "data2":np.random.standard_normal(7)})
df

   key1  key2     data1     data2
0     a     1 -0.300419 -0.586908
1     a     2  0.022509 -0.211404
2  None     1 -0.813066 -0.330094
3     b     2  0.998124  0.665538
4     b     1  0.224046  0.565914
5     a  <NA> -0.700261 -1.465647
6  None     1  1.754561  0.591716

In [3]:
grouped=df["data1"].groupby(df["key1"])
grouped

In [4]:
grouped.mean()

key1
a   -0.326057
b    0.611085
Name: data1, dtype: float64

In [5]:
grouped.value_counts()

key1  data1
a     -0.700261    1
      -0.300419    1
       0.022509    1
b      0.224046    1
       0.998124    1
Name: count, dtype: int64

In [6]:
means=df["data1"].groupby([df["key1"],df["key2"]]).mean()
means

key1  key2
a     1      -0.300419
      2       0.022509
b     1       0.224046
      2       0.998124
Name: data1, dtype: float64

In [7]:
means.unstack()

key2         1         2
key1
a    -0.300419  0.022509
b     0.224046  0.998124

In [8]:
states=np.array(["OH","CA","CA","OH","OH","CA","OH"])
years=[2005,2005,2006,2005,2006,2005,2006]
df

   key1  key2     data1     data2
0     a     1 -0.300419 -0.586908
1     a     2  0.022509 -0.211404
2  None     1 -0.813066 -0.330094
3     b     2  0.998124  0.665538
4     b     1  0.224046  0.565914
5     a  <NA> -0.700261 -1.465647
6  None     1  1.754561  0.591716

In [9]:
df["states"]=states
df["years"]=years
df

   key1  key2     data1     data2 states  years
0     a     1 -0.300419 -0.586908     OH   2005
1     a     2  0.022509 -0.211404     CA   2005
2  None     1 -0.813066 -0.330094     CA   2006
3     b     2  0.998124  0.665538     OH   2005
4     b     1  0.224046  0.565914     OH   2006
5     a  <NA> -0.700261 -1.465647     CA   2005
6  None     1  1.754561  0.591716     OH   2006

In [10]:
df1=df["data1"]
df1

0   -0.300419
1    0.022509
2   -0.813066
3    0.998124
4    0.224046
5   -0.700261
6    1.754561
Name: data1, dtype: float64

In [11]:
df1.groupby([states,years]).mean()

CA  2005   -0.338876
    2006   -0.813066
OH  2005    0.348853
    2006    0.989304
Name: data1, dtype: float64

In [12]:
df=df.drop(columns=["states","years"])

In [13]:
df

   key1  key2     data1     data2
0     a     1 -0.300419 -0.586908
1     a     2  0.022509 -0.211404
2  None     1 -0.813066 -0.330094
3     b     2  0.998124  0.665538
4     b     1  0.224046  0.565914
5     a  <NA> -0.700261 -1.465647
6  None     1  1.754561  0.591716

In [14]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5 -0.326057 -0.754653
b      1.5  0.611085  0.615726

In [15]:
df.groupby("key2").mean(numeric_only=True)

         data1     data2
key2
1     0.216280  0.060157
2     0.510317  0.227067

In [16]:
df.groupby(["key1","key2"]).mean()

              data1     data2
key1 key2
a    1    -0.300419 -0.586908
     2     0.022509 -0.211404
b    1     0.224046  0.565914
     2     0.998124  0.665538

In [17]:
df

   key1  key2     data1     data2
0     a     1 -0.300419 -0.586908
1     a     2  0.022509 -0.211404
2  None     1 -0.813066 -0.330094
3     b     2  0.998124  0.665538
4     b     1  0.224046  0.565914
5     a  <NA> -0.700261 -1.465647
6  None     1  1.754561  0.591716

In [18]:
df.groupby(["key1","key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [19]:
df.groupby(["key1","key2"],dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [20]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [21]:
df.groupby("key1").size()

key1
a    3
b    2
dtype: int64

### Iterating over Groups

In [22]:
for name,group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.300419 -0.586908
1    a     2  0.022509 -0.211404
5    a  <NA> -0.700261 -1.465647
b
  key1  key2     data1     data2
3    b     2  0.998124  0.665538
4    b     1  0.224046  0.565914

In [23]:
for (k1,k2),group in df.groupby(["key1","key2"]):
    print(k1)
    print(k2)
    print(group)

a
1
  key1  key2     data1     data2
0    a     1 -0.300419 -0.586908
a
2
  key1  key2     data1     data2
1    a     2  0.022509 -0.211404
b
1
  key1  key2     data1     data2
4    b     1  0.224046  0.565914
b
2
  key1  key2     data1     data2
3    b     2  0.998124  0.665538

In [24]:
pieces={name:group for name,group in df.groupby("key1")}
pieces

{'a':   key1  key2     data1     data2
 0    a     1 -0.300419 -0.586908
 1    a     2  0.022509 -0.211404
 5    a  <NA> -0.700261 -1.465647,
 'b':   key1  key2     data1     data2
 3    b     2  0.998124  0.665538
 4    b     1  0.224046  0.565914}

In [25]:
pieces["b"]

  key1  key2     data1     data2
3    b     2  0.998124  0.665538
4    b     1  0.224046  0.565914

In [26]:
df

   key1  key2     data1     data2
0     a     1 -0.300419 -0.586908
1     a     2  0.022509 -0.211404
2  None     1 -0.813066 -0.330094
3     b     2  0.998124  0.665538
4     b     1  0.224046  0.565914
5     a  <NA> -0.700261 -1.465647
6  None     1  1.754561  0.591716

In [27]:
grouped=df.groupby({"key1":"key","key2":"key","data1":"data","data2":"data"},axis="columns")
grouped

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\1160632884.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped=df.groupby({"key1":"key","key2":"key","data1":"data","data2":"data"},axis="columns")

In [28]:
df.T

              0         1         2         3         4         5         6
key1          a         a      None         b         b         a      None
key2          1         2         1         2         1      <NA>         1
data1 -0.300419  0.022509 -0.813066  0.998124  0.224046 -0.700261  1.754561
data2 -0.586908 -0.211404 -0.330094  0.665538  0.565914 -1.465647  0.591716

In [29]:
list(grouped)

[('data',
        data1     data2
  0 -0.300419 -0.586908
  1  0.022509 -0.211404
  2 -0.813066 -0.330094
  3  0.998124  0.665538
  4  0.224046  0.565914
  5 -0.700261 -1.465647
  6  1.754561  0.591716),
 ('key',
     key1  key2
  0     a     1
  1     a     2
  2  None     1
  3     b     2
  4     b     1
  5     a  <NA>
  6  None     1)]

In [30]:
for group_key,group_values in grouped:
    print(group_key)
    print(group_values)

data
      data1     data2
0 -0.300419 -0.586908
1  0.022509 -0.211404
2 -0.813066 -0.330094
3  0.998124  0.665538
4  0.224046  0.565914
5 -0.700261 -1.465647
6  1.754561  0.591716
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

### Selecting a Column or Subset of Columns

In [31]:
list(df.groupby("key1")["data1"])

[('a',
  0   -0.300419
  1    0.022509
  5   -0.700261
  Name: data1, dtype: float64),
 ('b',
  3    0.998124
  4    0.224046
  Name: data1, dtype: float64)]

In [32]:
list(df["data1"].groupby(df["key1"]))

[('a',
  0   -0.300419
  1    0.022509
  5   -0.700261
  Name: data1, dtype: float64),
 ('b',
  3    0.998124
  4    0.224046
  Name: data1, dtype: float64)]

In [33]:
df.groupby(["key1","key2"])[["data2"]].mean()

              data2
key1 key2
a    1    -0.586908
     2    -0.211404
b    1     0.565914
     2     0.665538

In [34]:
df.groupby(["key1", "key2"])["data2"].mean()

key1  key2
a     1      -0.586908
      2      -0.211404
b     1       0.565914
      2       0.665538
Name: data2, dtype: float64

### Grouping with Dictionaries and Series

In [35]:
people=pd.DataFrame(np.random.standard_normal((5,5)),
                    columns=["a","b","c","d","e"],
                    index=["Joe","Steve","Wanda","Jill","Trey"])
people

              a         b         c         d         e
Joe    0.835361 -0.633826 -0.647361 -0.785362 -0.738014
Steve  0.286503 -1.687778  0.732000 -0.098035 -0.476565
Wanda -0.503046  2.170454  1.057584 -0.719370 -1.655284
Jill  -1.560671  0.942002 -1.016816  0.883906  0.786405
Trey  -0.140746 -0.359886  0.506364 -0.722700  0.443869

In [36]:
people.iloc[2,[1,2]]=np.nan
people

              a         b         c         d         e
Joe    0.835361 -0.633826 -0.647361 -0.785362 -0.738014
Steve  0.286503 -1.687778  0.732000 -0.098035 -0.476565
Wanda -0.503046       NaN       NaN -0.719370 -1.655284
Jill  -1.560671  0.942002 -1.016816  0.883906  0.786405
Trey  -0.140746 -0.359886  0.506364 -0.722700  0.443869

In [37]:
mapping={"a":"red","b":"red","c":"blue","d":"blue","e":"red","f":"orange"}

In [38]:
by_column=people.groupby(mapping,axis="columns")
by_column.sum()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\1683895776.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column=people.groupby(mapping,axis="columns")

           blue       red
Joe   -1.432724 -0.536479
Steve  0.633965 -1.877840
Wanda -0.719370 -2.158331
Jill  -0.132910  0.167736
Trey  -0.216336 -0.056763

In [39]:
map_series=pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
people.groupby(map_series,axis="columns").sum()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\1495142927.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series,axis="columns").sum()

           blue       red
Joe   -1.432724 -0.536479
Steve  0.633965 -1.877840
Wanda -0.719370 -2.158331
Jill  -0.132910  0.167736
Trey  -0.216336 -0.056763

### Grouping with Functions

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.835361 -0.633826 -0.647361 -0.785362 -0.738014
4 -1.701416  0.582116 -0.510452  0.161206  1.230274
5 -0.216543 -1.687778  0.732000 -0.817404 -2.131849

In [42]:
people

              a         b         c         d         e
Joe    0.835361 -0.633826 -0.647361 -0.785362 -0.738014
Steve  0.286503 -1.687778  0.732000 -0.098035 -0.476565
Wanda -0.503046       NaN       NaN -0.719370 -1.655284
Jill  -1.560671  0.942002 -1.016816  0.883906  0.786405
Trey  -0.140746 -0.359886  0.506364 -0.722700  0.443869

In [43]:
key_list=["one","one","one","two","two"]
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  0.835361 -0.633826 -0.647361 -0.785362 -0.738014
4 two -1.560671 -0.359886 -1.016816 -0.722700  0.443869
5 one -0.503046 -1.687778  0.732000 -0.719370 -1.655284

In [44]:
list(people.groupby([len,key_list]))

[((3, 'one'),
              a         b         c         d         e
  Joe  0.835361 -0.633826 -0.647361 -0.785362 -0.738014),
 ((4, 'two'),
               a         b         c         d         e
  Jill -1.560671  0.942002 -1.016816  0.883906  0.786405
  Trey -0.140746 -0.359886  0.506364 -0.722700  0.443869),
 ((5, 'one'),
                a         b      c         d         e
  Steve  0.286503 -1.687778  0.732 -0.098035 -0.476565
  Wanda -0.503046       NaN    NaN -0.719370 -1.655284)]

### Grouping by Index Levels

In [45]:
columns=pd.MultiIndex.from_arrays([["US","US","US","JP","JP"],
                                   [1,3,5,1,3]],
                                   names=["cty","tenor"])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [46]:
hier_df=pd.DataFrame(np.random.standard_normal((4,5)),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.751084 -0.415917 -0.986483 -1.889998 -0.498211
1     -0.945898  1.516543  0.979939 -0.780384  1.921531
2      0.129086  0.048207 -0.496643 -0.690496 -0.617978
3      2.321490 -0.558681  0.604370 -0.787565  0.538013

In [47]:
hier_df.groupby(level="cty",axis="columns").count()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\1991154737.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="cty",axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2: Data Aggregation

In [48]:
df

   key1  key2     data1     data2
0     a     1 -0.300419 -0.586908
1     a     2  0.022509 -0.211404
2  None     1 -0.813066 -0.330094
3     b     2  0.998124  0.665538
4     b     1  0.224046  0.565914
5     a  <NA> -0.700261 -1.465647
6  None     1  1.754561  0.591716

In [49]:
grouped=df.groupby("key1")
grouped["data1"].nsmallest(2)

key1
a     5   -0.700261
      0   -0.300419
b     4    0.224046
      3    0.998124
Name: data1, dtype: float64

In [50]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [51]:
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  0.722770  1.254243
b        1  0.774079  0.099623

In [52]:
list(grouped)

[('a',
    key1  key2     data1     data2
  0    a     1 -0.300419 -0.586908
  1    a     2  0.022509 -0.211404
  5    a  <NA> -0.700261 -1.465647),
 ('b',
    key1  key2     data1     data2
  3    b     2  0.998124  0.665538
  4    b     1  0.224046  0.565914)]

In [53]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0 -0.326057  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.611085  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a    -0.138955  0.022509   3.0 -0.754653  0.643728 -1.465647 -1.026278
b     0.804605  0.998124   2.0  0.615726  0.070444  0.565914  0.590820


           50%       75%       max
key1
a    -0.586908 -0.399156 -0.211404
b     0.615726  0.640632  0.665538

[2 rows x 24 columns]

### Column-Wise and Multiple Function Application

In [54]:
tips=pd.read_csv("../../examples/tips.csv")
tips["tip_pct"]=tips["tip"]/tips["total_bill"]
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [55]:
grouped=tips.groupby(["day","smoker"])
list(grouped)

[(('Fri', 'No'),
       total_bill   tip smoker  day    time  size   tip_pct
  91        22.49  3.50     No  Fri  Dinner     2  0.155625
  94        22.75  3.25     No  Fri  Dinner     2  0.142857
  99        12.46  1.50     No  Fri  Dinner     2  0.120385
  223       15.98  3.00     No  Fri   Lunch     3  0.187735),
 (('Fri', 'Yes'),
       total_bill   tip smoker  day    time  size   tip_pct
  90        28.97  3.00    Yes  Fri  Dinner     2  0.103555
  92         5.75  1.00    Yes  Fri  Dinner     2  0.173913
  93        16.32  4.30    Yes  Fri  Dinner     2  0.263480
  95        40.17  4.73    Yes  Fri  Dinner     4  0.117750
  96        27.28  4.00    Yes  Fri  Dinner     2  0.146628
  97        12.03  1.50    Yes  Fri  Dinner     2  0.124688
  98        21.01  3.00    Yes  Fri  Dinner     2  0.142789
  100       11.35  2.50    Yes  Fri  Dinner     2  0.220264
  101       15.38  3.00    Yes  Fri  Dinner     2  0.195059
  220       12.16  2.20    Yes  Fri   Lunch     2  0.180921
  221       13.42  3.48    Yes  Fri   Lunch     2  0.259314
  222        8.58  1.92    Yes  Fri   Lunch     1  0.223776
  224       13.42  1.58    Yes  Fri   Lunch     2  0.117735
  225       16.27  2.50    Yes  Fri   Lunch     2  0.153657
  226       10.09  2.00    Yes  Fri   Lunch     2  0.198216),
 (('Sat', 'No'),
       total_bill   tip smoker  day    time  size   tip_pct
  19        20.65  3.35     No  Sat  Dinner     3  0.162228
  20        17.92  4.08     No  Sat  Dinner     2  0.227679
  21        20.29  2.75     No  Sat  Dinner     2  0.135535
  22        15.77  2.23     No  Sat  Dinner     2  0.141408
  23        39.42  7.58     No  Sat  Dinner     4  0.192288
  24        19.82  3.18     No  Sat  Dinner     2  0.160444
  25        17.81  2.34     No  Sat  Dinner     4  0.131387
  26        13.37  2.00     No  Sat  Dinner     2  0.149589
  27        12.69  2.00     No  Sat  Dinner     2  0.157604
  28        21.70  4.30     No  Sat  Dinner     2  0.198157
  29        19.65  3.00     No  Sat  Dinner     2  0.152672
  30         9.55  1.45     No  Sat  Dinner     2  0.151832
  31        18.35  2.50     No  Sat  Dinner     4  0.136240
  32        15.06  3.00     No  Sat  Dinner     2  0.199203
  33        20.69  2.45     No  Sat  Dinner     4  0.118415
  34        17.78  3.27     No  Sat  Dinner     2  0.183915
  35        24.06  3.60     No  Sat  Dinner     3  0.149626
  36        16.31  2.00     No  Sat  Dinner     3  0.122624
  37        16.93  3.07     No  Sat  Dinner     3  0.181335
  38        18.69  2.31     No  Sat  Dinner     3  0.123596
  39        31.27  5.00     No  Sat  Dinner     3  0.159898
  40        16.04  2.24     No  Sat  Dinner     3  0.139651
  57        26.41  1.50     No  Sat  Dinner     2  0.056797
  59        48.27  6.73     No  Sat  Dinner     4  0.139424
  64        17.59  2.64     No  Sat  Dinner     3  0.150085
  65        20.08  3.15     No  Sat  Dinner     3  0.156873
  66        16.45  2.47     No  Sat  Dinner     2  0.150152
  68        20.23  2.01     No  Sat  Dinner     2  0.099357
  70        12.02  1.97     No  Sat  Dinner     2  0.163894
  71        17.07  3.00     No  Sat  Dinner     3  0.175747
  74        14.73  2.20     No  Sat  Dinner     2  0.149355
  75        10.51  1.25     No  Sat  Dinner     2  0.118934
  104       20.92  4.08     No  Sat  Dinner     2  0.195029
  108       18.24  3.76     No  Sat  Dinner     2  0.206140
  110       14.00  3.00     No  Sat  Dinner     2  0.214286
  111        7.25  1.00     No  Sat  Dinner     1  0.137931
  212       48.33  9.00     No  Sat  Dinner     4  0.186220
  227       20.45  3.00     No  Sat  Dinner     4  0.146699
  228       13.28  2.72     No  Sat  Dinner     2  0.204819
  232       11.61  3.39     No  Sat  Dinner     2  0.291990
  233       10.77  1.47     No  Sat  Dinner     2  0.136490
  235       10.07  1.25     No  Sat  Dinner     2  0.124131
  238       35.83  4.67     No  Sat  Dinner     3  0.130338
  239       29.03  5.92     No  Sat  Dinner     3  0.203927
  242       17.82  1.75     No  Sat  Dinner     2  0.098204),
 (('Sat', 'Yes'),
       total_bill    tip smoker  day    time  size   tip_pct
  56        38.01   3.00    Yes  Sat  Dinner     4  0.078927
  58        11.24   1.76    Yes  Sat  Dinner     2  0.156584
  60        20.29   3.21    Yes  Sat  Dinner     2  0.158206
  61        13.81   2.00    Yes  Sat  Dinner     2  0.144823
  62        11.02   1.98    Yes  Sat  Dinner     2  0.179673
  63        18.29   3.76    Yes  Sat  Dinner     4  0.205577
  67         3.07   1.00    Yes  Sat  Dinner     1  0.325733
  69        15.01   2.09    Yes  Sat  Dinner     2  0.139241
  72        26.86   3.14    Yes  Sat  Dinner     2  0.116902
  73        25.28   5.00    Yes  Sat  Dinner     2  0.197785
  76        17.92   3.08    Yes  Sat  Dinner     2  0.171875
  102       44.30   2.50    Yes  Sat  Dinner     3  0.056433
  103       22.42   3.48    Yes  Sat  Dinner     2  0.155219
  105       15.36   1.64    Yes  Sat  Dinner     2  0.106771
  106       20.49   4.06    Yes  Sat  Dinner     2  0.198145
  107       25.21   4.29    Yes  Sat  Dinner     2  0.170171
  109       14.31   4.00    Yes  Sat  Dinner     2  0.279525
  168       10.59   1.61    Yes  Sat  Dinner     2  0.152030
  169       10.63   2.00    Yes  Sat  Dinner     2  0.188147
  170       50.81  10.00    Yes  Sat  Dinner     3  0.196812
  171       15.81   3.16    Yes  Sat  Dinner     2  0.199873
  206       26.59   3.41    Yes  Sat  Dinner     3  0.128244
  207       38.73   3.00    Yes  Sat  Dinner     4  0.077459
  208       24.27   2.03    Yes  Sat  Dinner     2  0.083642
  209       12.76   2.23    Yes  Sat  Dinner     2  0.174765
  210       30.06   2.00    Yes  Sat  Dinner     3  0.066534
  211       25.89   5.16    Yes  Sat  Dinner     4  0.199305
  213       13.27   2.50    Yes  Sat  Dinner     2  0.188395
  214       28.17   6.50    Yes  Sat  Dinner     3  0.230742
  215       12.90   1.10    Yes  Sat  Dinner     2  0.085271
  216       28.15   3.00    Yes  Sat  Dinner     5  0.106572
  217       11.59   1.50    Yes  Sat  Dinner     2  0.129422
  218        7.74   1.44    Yes  Sat  Dinner     2  0.186047
  219       30.14   3.09    Yes  Sat  Dinner     4  0.102522
  229       22.12   2.88    Yes  Sat  Dinner     2  0.130199
  230       24.01   2.00    Yes  Sat  Dinner     4  0.083299
  231       15.69   3.00    Yes  Sat  Dinner     3  0.191205
  234       15.53   3.00    Yes  Sat  Dinner     2  0.193175
  236       12.60   1.00    Yes  Sat  Dinner     2  0.079365
  237       32.83   1.17    Yes  Sat  Dinner     2  0.035638
  240       27.18   2.00    Yes  Sat  Dinner     2  0.073584
  241       22.67   2.00    Yes  Sat  Dinner     2  0.088222),
 (('Sun', 'No'),
       total_bill   tip smoker  day    time  size   tip_pct
  0         16.99  1.01     No  Sun  Dinner     2  0.059447
  1         10.34  1.66     No  Sun  Dinner     3  0.160542
  2         21.01  3.50     No  Sun  Dinner     3  0.166587
  3         23.68  3.31     No  Sun  Dinner     2  0.139780
  4         24.59  3.61     No  Sun  Dinner     4  0.146808
  5         25.29  4.71     No  Sun  Dinner     4  0.186240
  6          8.77  2.00     No  Sun  Dinner     2  0.228050
  7         26.88  3.12     No  Sun  Dinner     4  0.116071
  8         15.04  1.96     No  Sun  Dinner     2  0.130319
  9         14.78  3.23     No  Sun  Dinner     2  0.218539
  10        10.27  1.71     No  Sun  Dinner     2  0.166504
  11        35.26  5.00     No  Sun  Dinner     4  0.141804
  12        15.42  1.57     No  Sun  Dinner     2  0.101816
  13        18.43  3.00     No  Sun  Dinner     4  0.162778
  14        14.83  3.02     No  Sun  Dinner     2  0.203641
  15        21.58  3.92     No  Sun  Dinner     2  0.181650
  16        10.33  1.67     No  Sun  Dinner     3  0.161665
  17        16.29  3.71     No  Sun  Dinner     3  0.227747
  18        16.97  3.50     No  Sun  Dinner     3  0.206246
  41        17.46  2.54     No  Sun  Dinner     2  0.145475
  42        13.94  3.06     No  Sun  Dinner     2  0.219512
  43         9.68  1.32     No  Sun  Dinner     2  0.136364
  44        30.40  5.60     No  Sun  Dinner     4  0.184211
  45        18.29  3.00     No  Sun  Dinner     2  0.164024
  46        22.23  5.00     No  Sun  Dinner     2  0.224921
  47        32.40  6.00     No  Sun  Dinner     4  0.185185
  48        28.55  2.05     No  Sun  Dinner     3  0.071804
  49        18.04  3.00     No  Sun  Dinner     2  0.166297
  50        12.54  2.50     No  Sun  Dinner     2  0.199362
  51        10.29  2.60     No  Sun  Dinner     2  0.252672
  52        34.81  5.20     No  Sun  Dinner     4  0.149382
  53         9.94  1.56     No  Sun  Dinner     2  0.156942
  54        25.56  4.34     No  Sun  Dinner     4  0.169797
  55        19.49  3.51     No  Sun  Dinner     2  0.180092
  112       38.07  4.00     No  Sun  Dinner     3  0.105070
  113       23.95  2.55     No  Sun  Dinner     2  0.106472
  114       25.71  4.00     No  Sun  Dinner     3  0.155581
  115       17.31  3.50     No  Sun  Dinner     2  0.202195
  116       29.93  5.07     No  Sun  Dinner     4  0.169395
  150       14.07  2.50     No  Sun  Dinner     2  0.177683
  151       13.13  2.00     No  Sun  Dinner     2  0.152323
  152       17.26  2.74     No  Sun  Dinner     3  0.158749
  153       24.55  2.00     No  Sun  Dinner     4  0.081466
  154       19.77  2.00     No  Sun  Dinner     4  0.101163
  155       29.85  5.14     No  Sun  Dinner     5  0.172194
  156       48.17  5.00     No  Sun  Dinner     6  0.103799
  157       25.00  3.75     No  Sun  Dinner     4  0.150000
  158       13.39  2.61     No  Sun  Dinner     2  0.194922
  159       16.49  2.00     No  Sun  Dinner     4  0.121286
  160       21.50  3.50     No  Sun  Dinner     4  0.162791
  161       12.66  2.50     No  Sun  Dinner     2  0.197472
  162       16.21  2.00     No  Sun  Dinner     3  0.123381
  163       13.81  2.00     No  Sun  Dinner     2  0.144823
  165       24.52  3.48     No  Sun  Dinner     3  0.141925
  166       20.76  2.24     No  Sun  Dinner     2  0.107900
  167       31.71  4.50     No  Sun  Dinner     4  0.141911
  185       20.69  5.00     No  Sun  Dinner     5  0.241663),
 (('Sun', 'Yes'),
       total_bill   tip smoker  day    time  size   tip_pct
  164       17.51  3.00    Yes  Sun  Dinner     2  0.171331
  172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
  173       31.85  3.18    Yes  Sun  Dinner     2  0.099843
  174       16.82  4.00    Yes  Sun  Dinner     2  0.237812
  175       32.90  3.11    Yes  Sun  Dinner     2  0.094529
  176       17.89  2.00    Yes  Sun  Dinner     2  0.111794
  177       14.48  2.00    Yes  Sun  Dinner     2  0.138122
  178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
  179       34.63  3.55    Yes  Sun  Dinner     2  0.102512
  180       34.65  3.68    Yes  Sun  Dinner     4  0.106205
  181       23.33  5.65    Yes  Sun  Dinner     2  0.242177
  182       45.35  3.50    Yes  Sun  Dinner     3  0.077178
  183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
  184       40.55  3.00    Yes  Sun  Dinner     2  0.073983
  186       20.90  3.50    Yes  Sun  Dinner     3  0.167464
  187       30.46  2.00    Yes  Sun  Dinner     5  0.065660
  188       18.15  3.50    Yes  Sun  Dinner     3  0.192837
  189       23.10  4.00    Yes  Sun  Dinner     3  0.173160
  190       15.69  1.50    Yes  Sun  Dinner     2  0.095602),
 (('Thur', 'No'),
       total_bill   tip smoker   day    time  size   tip_pct
  77        27.20  4.00     No  Thur   Lunch     4  0.147059
  78        22.76  3.00     No  Thur   Lunch     2  0.131810
  79        17.29  2.71     No  Thur   Lunch     2  0.156738
  81        16.66  3.40     No  Thur   Lunch     2  0.204082
  82        10.07  1.83     No  Thur   Lunch     1  0.181728
  84        15.98  2.03     No  Thur   Lunch     2  0.127034
  85        34.83  5.17     No  Thur   Lunch     4  0.148435
  86        13.03  2.00     No  Thur   Lunch     2  0.153492
  87        18.28  4.00     No  Thur   Lunch     2  0.218818
  88        24.71  5.85     No  Thur   Lunch     2  0.236746
  89        21.16  3.00     No  Thur   Lunch     2  0.141777
  117       10.65  1.50     No  Thur   Lunch     2  0.140845
  118       12.43  1.80     No  Thur   Lunch     2  0.144811
  119       24.08  2.92     No  Thur   Lunch     4  0.121262
  120       11.69  2.31     No  Thur   Lunch     2  0.197605
  121       13.42  1.68     No  Thur   Lunch     2  0.125186
  122       14.26  2.50     No  Thur   Lunch     2  0.175316
  123       15.95  2.00     No  Thur   Lunch     2  0.125392
  124       12.48  2.52     No  Thur   Lunch     2  0.201923
  125       29.80  4.20     No  Thur   Lunch     6  0.140940
  126        8.52  1.48     No  Thur   Lunch     2  0.173709
  127       14.52  2.00     No  Thur   Lunch     2  0.137741
  128       11.38  2.00     No  Thur   Lunch     2  0.175747
  129       22.82  2.18     No  Thur   Lunch     3  0.095530
  130       19.08  1.50     No  Thur   Lunch     2  0.078616
  131       20.27  2.83     No  Thur   Lunch     2  0.139615
  132       11.17  1.50     No  Thur   Lunch     2  0.134288
  133       12.26  2.00     No  Thur   Lunch     2  0.163132
  134       18.26  3.25     No  Thur   Lunch     2  0.177985
  135        8.51  1.25     No  Thur   Lunch     2  0.146886
  136       10.33  2.00     No  Thur   Lunch     2  0.193611
  137       14.15  2.00     No  Thur   Lunch     2  0.141343
  139       13.16  2.75     No  Thur   Lunch     2  0.208967
  140       17.47  3.50     No  Thur   Lunch     2  0.200343
  141       34.30  6.70     No  Thur   Lunch     6  0.195335
  142       41.19  5.00     No  Thur   Lunch     5  0.121389
  143       27.05  5.00     No  Thur   Lunch     6  0.184843
  144       16.43  2.30     No  Thur   Lunch     2  0.139988
  145        8.35  1.50     No  Thur   Lunch     2  0.179641
  146       18.64  1.36     No  Thur   Lunch     3  0.072961
  147       11.87  1.63     No  Thur   Lunch     2  0.137321
  148        9.78  1.73     No  Thur   Lunch     2  0.176892
  149        7.51  2.00     No  Thur   Lunch     2  0.266312
  195        7.56  1.44     No  Thur   Lunch     2  0.190476
  243       18.78  3.00     No  Thur  Dinner     2  0.159744),
 (('Thur', 'Yes'),
       total_bill   tip smoker   day   time  size   tip_pct
  80        19.44  3.00    Yes  Thur  Lunch     2  0.154321
  83        32.68  5.00    Yes  Thur  Lunch     2  0.152999
  138       16.00  2.00    Yes  Thur  Lunch     2  0.125000
  191       19.81  4.19    Yes  Thur  Lunch     2  0.211509
  192       28.44  2.56    Yes  Thur  Lunch     2  0.090014
  193       15.48  2.02    Yes  Thur  Lunch     2  0.130491
  194       16.58  4.00    Yes  Thur  Lunch     2  0.241255
  196       10.34  2.00    Yes  Thur  Lunch     2  0.193424
  197       43.11  5.00    Yes  Thur  Lunch     4  0.115982
  198       13.00  2.00    Yes  Thur  Lunch     2  0.153846
  199       13.51  2.00    Yes  Thur  Lunch     2  0.148038
  200       18.71  4.00    Yes  Thur  Lunch     3  0.213789
  201       12.74  2.01    Yes  Thur  Lunch     2  0.157771
  202       13.00  2.00    Yes  Thur  Lunch     2  0.153846
  203       16.40  2.50    Yes  Thur  Lunch     2  0.152439
  204       20.53  4.00    Yes  Thur  Lunch     4  0.194837
  205       16.47  3.23    Yes  Thur  Lunch     3  0.196114)]

In [56]:
grouped_pct=grouped["tip_pct"]
list(grouped_pct)

[(('Fri', 'No'),
  91     0.155625
  94     0.142857
  99     0.120385
  223    0.187735
  Name: tip_pct, dtype: float64),
 (('Fri', 'Yes'),
  90     0.103555
  92     0.173913
  93     0.263480
  95     0.117750
  96     0.146628
  97     0.124688
  98     0.142789
  100    0.220264
  101    0.195059
  220    0.180921
  221    0.259314
  222    0.223776
  224    0.117735
  225    0.153657
  226    0.198216
  Name: tip_pct, dtype: float64),
 (('Sat', 'No'),
  19     0.162228
  20     0.227679
  21     0.135535
  22     0.141408
  23     0.192288
  24     0.160444
  25     0.131387
  26     0.149589
  27     0.157604
  28     0.198157
  29     0.152672
  30     0.151832
  31     0.136240
  32     0.199203
  33     0.118415
  34     0.183915
  35     0.149626
  36     0.122624
  37     0.181335
  38     0.123596
  39     0.159898
  40     0.139651
  57     0.056797
  59     0.139424
  64     0.150085
  65     0.156873
  66     0.150152
  68     0.099357
  70     0.163894
  71     0.175747
  74     0.149355
  75     0.118934
  104    0.195029
  108    0.206140
  110    0.214286
  111    0.137931
  212    0.186220
  227    0.146699
  228    0.204819
  232    0.291990
  233    0.136490
  235    0.124131
  238    0.130338
  239    0.203927
  242    0.098204
  Name: tip_pct, dtype: float64),
 (('Sat', 'Yes'),
  56     0.078927
  58     0.156584
  60     0.158206
  61     0.144823
  62     0.179673
  63     0.205577
  67     0.325733
  69     0.139241
  72     0.116902
  73     0.197785
  76     0.171875
  102    0.056433
  103    0.155219
  105    0.106771
  106    0.198145
  107    0.170171
  109    0.279525
  168    0.152030
  169    0.188147
  170    0.196812
  171    0.199873
  206    0.128244
  207    0.077459
  208    0.083642
  209    0.174765
  210    0.066534
  211    0.199305
  213    0.188395
  214    0.230742
  215    0.085271
  216    0.106572
  217    0.129422
  218    0.186047
  219    0.102522
  229    0.130199
  230    0.083299
  231    0.191205
  234    0.193175
  236    0.079365
  237    0.035638
  240    0.073584
  241    0.088222
  Name: tip_pct, dtype: float64),
 (('Sun', 'No'),
  0      0.059447
  1      0.160542
  2      0.166587
  3      0.139780
  4      0.146808
  5      0.186240
  6      0.228050
  7      0.116071
  8      0.130319
  9      0.218539
  10     0.166504
  11     0.141804
  12     0.101816
  13     0.162778
  14     0.203641
  15     0.181650
  16     0.161665
  17     0.227747
  18     0.206246
  41     0.145475
  42     0.219512
  43     0.136364
  44     0.184211
  45     0.164024
  46     0.224921
  47     0.185185
  48     0.071804
  49     0.166297
  50     0.199362
  51     0.252672
  52     0.149382
  53     0.156942
  54     0.169797
  55     0.180092
  112    0.105070
  113    0.106472
  114    0.155581
  115    0.202195
  116    0.169395
  150    0.177683
  151    0.152323
  152    0.158749
  153    0.081466
  154    0.101163
  155    0.172194
  156    0.103799
  157    0.150000
  158    0.194922
  159    0.121286
  160    0.162791
  161    0.197472
  162    0.123381
  163    0.144823
  165    0.141925
  166    0.107900
  167    0.141911
  185    0.241663
  Name: tip_pct, dtype: float64),
 (('Sun', 'Yes'),
  164    0.171331
  172    0.710345
  173    0.099843
  174    0.237812
  175    0.094529
  176    0.111794
  177    0.138122
  178    0.416667
  179    0.102512
  180    0.106205
  181    0.242177
  182    0.077178
  183    0.280535
  184    0.073983
  186    0.167464
  187    0.065660
  188    0.192837
  189    0.173160
  190    0.095602
  Name: tip_pct, dtype: float64),
 (('Thur', 'No'),
  77     0.147059
  78     0.131810
  79     0.156738
  81     0.204082
  82     0.181728
  84     0.127034
  85     0.148435
  86     0.153492
  87     0.218818
  88     0.236746
  89     0.141777
  117    0.140845
  118    0.144811
  119    0.121262
  120    0.197605
  121    0.125186
  122    0.175316
  123    0.125392
  124    0.201923
  125    0.140940
  126    0.173709
  127    0.137741
  128    0.175747
  129    0.095530
  130    0.078616
  131    0.139615
  132    0.134288
  133    0.163132
  134    0.177985
  135    0.146886
  136    0.193611
  137    0.141343
  139    0.208967
  140    0.200343
  141    0.195335
  142    0.121389
  143    0.184843
  144    0.139988
  145    0.179641
  146    0.072961
  147    0.137321
  148    0.176892
  149    0.266312
  195    0.190476
  243    0.159744
  Name: tip_pct, dtype: float64),
 (('Thur', 'Yes'),
  80     0.154321
  83     0.152999
  138    0.125000
  191    0.211509
  192    0.090014
  193    0.130491
  194    0.241255
  196    0.193424
  197    0.115982
  198    0.153846
  199    0.148038
  200    0.213789
  201    0.157771
  202    0.153846
  203    0.152439
  204    0.194837
  205    0.196114
  Name: tip_pct, dtype: float64)]

In [57]:
grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [58]:
grouped_pct.mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [59]:
grouped_pct.agg(["mean","std",peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [60]:
grouped_pct.agg([("average","mean"),("stdev","std"),("peak_to_peak",peak_to_peak)])

              average     stdev  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [61]:
functions=["count","mean","max"]
result=grouped[["tip_pct","total_bill"]].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [62]:
result["tip_pct"]

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [63]:
ftuples=[("Average","mean"),("Variance",np.var)]
grouped[["tip_pct","total_bill"]].agg(ftuples)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\3377275874.py:2: FutureWarning: The provided callable <function var at 0x000002C97E604A40> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  grouped[["tip_pct","total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [64]:
grouped.agg({"tip":max,"size":sum})

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\973071891.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({"tip":max,"size":sum})
C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\973071891.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped.agg({"tip":max,"size":sum})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [65]:
grouped.agg({"tip_pct":["min","max","mean","std"],
             "size":"sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### Returning Aggregated Data Without Row Indexes

In [66]:
grouped = tips.groupby(["day", "smoker"], as_index=False)

In [67]:
grouped.mean(numeric_only=True)

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## 10.3: Apply: General split-apply-combine

In [68]:
def top(df,n=5,column="tip_pct"):
    return df.sort_values(column,ascending=False)[:n]

In [69]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [70]:
tips.groupby("smoker").apply(top)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\2530541573.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [71]:
tips.groupby(["smoker","day"]).apply(top,n=1,column="total_bill")

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\470388052.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby(["smoker","day"]).apply(top,n=1,column="total_bill")

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [72]:
result=tips.groupby("smoker")["tip_pct"].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [73]:
result.unstack("smoker")

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

### Suppressing the Group Keys

In [74]:
tips.groupby("smoker",group_keys=False).apply(top)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\507294496.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker",group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
232       11.61  3.39     No   Sat  Dinner     2  0.291990
149        7.51  2.00     No  Thur   Lunch     2  0.266312
51        10.29  2.60     No   Sun  Dinner     2  0.252672
185       20.69  5.00     No   Sun  Dinner     5  0.241663
88        24.71  5.85     No  Thur   Lunch     2  0.236746
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

### Quantile and Bucket Analysis

In [75]:
frame=pd.DataFrame({"data1":np.random.standard_normal(1000),
                    "data2":np.random.standard_normal(1000)})
frame

        data1     data2
0    2.080402  0.370317
1   -1.431476  0.550546
2    0.541374 -2.740820
3    0.458629 -1.315184
4    0.290861  0.376331
..        ...       ...
995  0.155982 -0.358233
996  0.247502 -1.387632
997 -0.545142 -0.469354
998 -1.089173 -0.883464
999 -1.779516 -1.555084

[1000 rows x 2 columns]

In [76]:
quartiles=pd.cut(frame["data1"],4)
quartiles

0        (1.612, 3.151]
1      (-1.466, 0.0732]
2       (0.0732, 1.612]
3       (0.0732, 1.612]
4       (0.0732, 1.612]
             ...
995     (0.0732, 1.612]
996     (0.0732, 1.612]
997    (-1.466, 0.0732]
998    (-1.466, 0.0732]
999    (-3.011, -1.466]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(-3.011, -1.466] < (-1.466, 0.0732] < (0.0732, 1.612] < (1.612, 3.151]]

In [77]:
grouped=frame.groupby(quartiles)
list(grouped)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\1005871307.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped=frame.groupby(quartiles)

[(Interval(-3.011, -1.466, closed='right'),
          data1     data2
  5   -2.548100  0.958548
  6   -2.058857  0.407344
  12  -2.348235 -1.236971
  13  -1.857022  0.943717
  18  -2.194926  0.457706
  ..        ...       ...
  968 -1.903163  1.475231
  978 -1.571478  0.347034
  979 -2.289458 -0.463921
  986 -1.726345 -0.645997
  999 -1.779516 -1.555084

  [65 rows x 2 columns]),
 (Interval(-1.466, 0.0732, closed='right'),
          data1     data2
  1   -1.431476  0.550546
  7   -1.208362 -0.663361
  8   -0.034645  1.743186
  9   -0.724567 -0.687755
  14  -0.359893 -0.604970
  ..        ...       ...
  989 -0.709492  0.987833
  992 -0.408291  0.007332
  994 -0.498493  0.563947
  997 -0.545142 -0.469354
  998 -1.089173 -0.883464

  [481 rows x 2 columns]),
 (Interval(0.0732, 1.612, closed='right'),
          data1     data2
  2    0.541374 -2.740820
  3    0.458629 -1.315184
  4    0.290861  0.376331
  10   1.373220 -0.971938
  11   0.988087  1.469074
  ..        ...       ...
  990  0.324557 -1.080073
  991  0.492472 -0.243462
  993  1.135864  1.903178
  995  0.155982 -0.358233
  996  0.247502 -1.387632

  [398 rows x 2 columns]),
 (Interval(1.612, 3.151, closed='right'),
          data1     data2
  0    2.080402  0.370317
  51   1.667121 -2.355636
  65   1.683105 -2.989791
  79   3.151188 -0.962086
  98   1.673601 -0.365415
  113  2.250410 -0.740668
  122  1.674630  0.862959
  167  2.481610 -0.016103
  175  2.229245 -1.146516
  205  1.640905 -0.862739
  221  2.426376 -0.859024
  228  2.211998 -0.120466
  233  1.765226 -1.243342
  241  1.634715 -0.952371
  254  2.458933  2.341764
  283  1.628054 -0.321122
  293  2.395737  1.631921
  300  1.863668  0.998300
  364  1.973381 -1.031453
  384  1.785553 -0.472597
  412  2.080296 -1.520437
  463  2.780013  0.104659
  470  1.640471 -1.495607
  495  1.756695 -0.367542
  500  2.537614  0.433375
  512  1.822475  0.966082
  541  2.207223  1.354204
  546  1.621210  0.312995
  550  1.738554  0.175846
  561  2.002453  0.546890
  569  2.139067  0.446482
  574  1.640349  0.704696
  617  1.690853 -0.173478
  658  1.638832  1.229954
  659  1.688577  0.566295
  693  1.939937  0.332596
  725  1.634002  0.417882
  734  1.635976 -1.078354
  736  2.477976 -0.593055
  765  1.718616 -0.745434
  768  1.713973 -1.714013
  774  1.730847 -2.188405
  790  2.167362 -1.352001
  811  2.351087 -0.921630
  817  2.103701  1.393188
  820  1.865661 -1.274851
  845  2.191906  2.803361
  886  2.186533 -0.887718
  894  1.844708  0.193612
  899  2.133143 -0.120373
  932  2.420353  0.488076
  939  1.897659 -0.016913
  949  2.219197  1.093988
  951  1.850074 -2.557608
  952  1.889552 -1.189921
  960  1.995868 -0.022417)]

In [78]:
def get_stats(group):
    return pd.DataFrame(
        {"min":group.min(),
         "max":group.max(),
         "count":group.count(),
         "mean":group.mean()}
    )

In [79]:
grouped.apply(get_stats)

                             min       max  count      mean
data1
(-3.011, -1.466] data1 -3.004731 -1.481534     65 -1.956123
                 data2 -3.235129  2.493799     65  0.017065
(-1.466, 0.0732] data1 -1.464267  0.072496    481 -0.600715
                 data2 -2.700942  2.699724    481 -0.050473
(0.0732, 1.612]  data1  0.075444  1.603785    398  0.679592
                 data2 -2.875026  2.901788    398 -0.081062
(1.612, 3.151]   data1  1.621210  3.151188     56  1.993369
                 data2 -2.989791  2.803361     56 -0.230172

In [80]:
grouped.agg(["min","max","count","mean"])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-3.011, -1.466] -3.004731 -1.481534    65 -1.956123 -3.235129  2.493799
(-1.466, 0.0732] -1.464267  0.072496   481 -0.600715 -2.700942  2.699724
(0.0732, 1.612]   0.075444  1.603785   398  0.679592 -2.875026  2.901788
(1.612, 3.151]    1.621210  3.151188    56  1.993369 -2.989791  2.803361


                 count      mean
data1
(-3.011, -1.466]    65  0.017065
(-1.466, 0.0732]   481 -0.050473
(0.0732, 1.612]    398 -0.081062
(1.612, 3.151]      56 -0.230172

In [81]:
quartiles_samp=pd.qcut(frame["data1"],4,labels=False)
quartiles_samp

0      3
1      0
2      2
3      2
4      2
      ..
995    2
996    2
997    1
998    0
999    0
Name: data1, Length: 1000, dtype: int64

In [82]:
grouped=frame.groupby(quartiles_samp)
list(grouped)

[(0,
          data1     data2
  1   -1.431476  0.550546
  5   -2.548100  0.958548
  6   -2.058857  0.407344
  7   -1.208362 -0.663361
  9   -0.724567 -0.687755
  ..        ...       ...
  980 -1.259444 -1.259251
  983 -1.138325 -0.561333
  986 -1.726345 -0.645997
  998 -1.089173 -0.883464
  999 -1.779516 -1.555084

  [250 rows x 2 columns]),
 (1,
          data1     data2
  14  -0.359893 -0.604970
  15  -0.102225  0.813182
  17  -0.713125  1.727681
  20  -0.213314  0.610218
  27  -0.551940 -0.964218
  ..        ...       ...
  981 -0.396056  0.259758
  989 -0.709492  0.987833
  992 -0.408291  0.007332
  994 -0.498493  0.563947
  997 -0.545142 -0.469354

  [250 rows x 2 columns]),
 (2,
          data1     data2
  2    0.541374 -2.740820
  3    0.458629 -1.315184
  4    0.290861  0.376331
  8   -0.034645  1.743186
  16   0.345256 -0.620236
  ..        ...       ...
  987  0.147565  0.954878
  990  0.324557 -1.080073
  991  0.492472 -0.243462
  995  0.155982 -0.358233
  996  0.247502 -1.387632

  [250 rows x 2 columns]),
 (3,
          data1     data2
  0    2.080402  0.370317
  10   1.373220 -0.971938
  11   0.988087  1.469074
  29   0.751082 -0.787729
  33   0.748924  0.565880
  ..        ...       ...
  970  1.526432  0.131031
  973  1.066996  0.598979
  984  0.712203  1.706586
  988  0.969304  0.152386
  993  1.135864  1.903178

  [250 rows x 2 columns])]

In [83]:
grouped.apply(get_stats)

                  min       max  count      mean
data1
0     data1 -3.004731 -0.719960    250 -1.284245
      data2 -3.235129  2.493799    250  0.021449
1     data1 -0.718594 -0.063190    250 -0.381067
      data2 -2.700942  2.699724    250 -0.097053
2     data1 -0.062109  0.619037    250  0.274076
      data2 -2.875026  2.689245    250 -0.093638
3     data1  0.623905  3.151188    250  1.255294
      data2 -2.989791  2.901788    250 -0.104041

### Example: Filling Missing Values with Group-Specific Values

In [84]:
s=pd.Series(np.random.standard_normal(6))
s[::2]=np.nan
s

0         NaN
1   -0.283955
2         NaN
3    1.318551
4         NaN
5    0.609977
dtype: float64

In [85]:
s.mean()
s.fillna(s.mean())

0.5481911908708438

0    0.548191
1   -0.283955
2    0.548191
3    1.318551
4    0.548191
5    0.609977
dtype: float64

In [86]:
states=["Ohio","New York","Vermont","Florida","Oregon","Nevada","California","Idaho"]
group_key=["East","East","East","East","West","West","West","West"]
data=pd.Series(np.random.standard_normal(8),index=states)
data

Ohio         -0.525966
New York     -1.133531
Vermont      -1.107117
Florida      -1.130024
Oregon        0.175582
Nevada       -0.396588
California    0.003008
Idaho         1.451254
dtype: float64

In [87]:
data[["Vermont","Nevada","Idaho"]]=np.nan
data

Ohio         -0.525966
New York     -1.133531
Vermont            NaN
Florida      -1.130024
Oregon        0.175582
Nevada             NaN
California    0.003008
Idaho              NaN
dtype: float64

In [88]:
list(data.groupby(group_key))

[('East',
  Ohio       -0.525966
  New York   -1.133531
  Vermont          NaN
  Florida    -1.130024
  dtype: float64),
 ('West',
  Oregon        0.175582
  Nevada             NaN
  California    0.003008
  Idaho              NaN
  dtype: float64)]

In [89]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [90]:
data.groupby(group_key).count()

East    3
West    2
dtype: int64

In [91]:
data.groupby(group_key).mean()

East   -0.929840
West    0.089295
dtype: float64

In [92]:
def fill_mean(group):
    return group.fillna(group.mean())

In [93]:
data.groupby(group_key).apply(fill_mean)

East  Ohio         -0.525966
      New York     -1.133531
      Vermont      -0.929840
      Florida      -1.130024
West  Oregon        0.175582
      Nevada        0.089295
      California    0.003008
      Idaho         0.089295
dtype: float64

In [94]:
fill_values={"East":0.5,"West":-1}
def fill_func(group):
    return group.fillna(fill_values[group.name])

In [95]:
data.groupby(group_key).apply(fill_func)

East  Ohio         -0.525966
      New York     -1.133531
      Vermont       0.500000
      Florida      -1.130024
West  Oregon        0.175582
      Nevada       -1.000000
      California    0.003008
      Idaho        -1.000000
dtype: float64

### Example: Random Sampling and Permutation

In [96]:
suits=["H","S","C","D"]
card_val=(list(range(1,11))+[10]*3)*4
card_val

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10]

In [97]:
base_names=["A"]+list(range(2,11))+["J","K","Q"]
base_names

['A', 2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'K', 'Q']

In [98]:
cards=[]
for suit in suits:
    cards.extend(str(num)+suit for num in base_names)
cards

['AH',
 '2H',
 '3H',
 '4H',
 '5H',
 '6H',
 '7H',
 '8H',
 '9H',
 '10H',
 'JH',
 'KH',
 'QH',
 'AS',
 '2S',
 '3S',
 '4S',
 '5S',
 '6S',
 '7S',
 '8S',
 '9S',
 '10S',
 'JS',
 'KS',
 'QS',
 'AC',
 '2C',
 '3C',
 '4C',
 '5C',
 '6C',
 '7C',
 '8C',
 '9C',
 '10C',
 'JC',
 'KC',
 'QC',
 'AD',
 '2D',
 '3D',
 '4D',
 '5D',
 '6D',
 '7D',
 '8D',
 '9D',
 '10D',
 'JD',
 'KD',
 'QD']

In [99]:
deck=pd.Series(card_val,index=cards)
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [100]:
def draw(deck,n=5):
    return deck.sample(n)

draw(deck)

2S      2
4H      4
3D      3
10S    10
JH     10
dtype: int64

In [101]:
def get_suit(card):
    return card[-1]

In [102]:
list(deck.groupby(get_suit))

[('C',
  AC      1
  2C      2
  3C      3
  4C      4
  5C      5
  6C      6
  7C      7
  8C      8
  9C      9
  10C    10
  JC     10
  KC     10
  QC     10
  dtype: int64),
 ('D',
  AD      1
  2D      2
  3D      3
  4D      4
  5D      5
  6D      6
  7D      7
  8D      8
  9D      9
  10D    10
  JD     10
  KD     10
  QD     10
  dtype: int64),
 ('H',
  AH      1
  2H      2
  3H      3
  4H      4
  5H      5
  6H      6
  7H      7
  8H      8
  9H      9
  10H    10
  JH     10
  KH     10
  QH     10
  dtype: int64),
 ('S',
  AS      1
  2S      2
  3S      3
  4S      4
  5S      5
  6S      6
  7S      7
  8S      8
  9S      9
  10S    10
  JS     10
  KS     10
  QS     10
  dtype: int64)]

In [103]:
deck.groupby(get_suit).apply(draw,n=2)

C  4C    4
   5C    5
D  2D    2
   4D    4
H  8H    8
   7H    7
S  3S    3
   6S    6
dtype: int64

In [104]:
deck.groupby(get_suit,group_keys=False).apply(draw,n=2)

8C      8
QC     10
10D    10
9D      9
KH     10
6H      6
7S      7
JS     10
dtype: int64

### Example: Group Weighted Average and Correlation

In [105]:
df=pd.DataFrame({"category":np.repeat(["a","b"],4).tolist(),
                 "data":np.random.standard_normal(8),
                 "weights":np.random.uniform(size=8)})
df

  category      data   weights
0        a  0.395041  0.587145
1        a  0.813366  0.663560
2        a  0.550545  0.485063
3        a -0.605817  0.426378
4        b -0.803828  0.414817
5        b -0.234892  0.165538
6        b  2.624712  0.350386
7        b  0.505257  0.922824

In [106]:
def get_wavg(group):
    return np.average(group["data"],weights=group["weights"])

grouped=df.groupby("category")

grouped.apply(get_wavg)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\604125060.py:6: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped.apply(get_wavg)

category
a    0.360940
b    0.546839
dtype: float64

In [107]:
close_px=pd.read_csv("../../examples/stock_px.csv",parse_dates=True,index_col=0)
close_px

              AAPL   MSFT    XOM      SPX
2003-01-02    7.40  21.11  29.22   909.03
2003-01-03    7.45  21.14  29.24   908.59
2003-01-06    7.45  21.52  29.96   929.01
2003-01-07    7.43  21.93  28.95   922.93
2003-01-08    7.28  21.31  28.83   909.93
...            ...    ...    ...      ...
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

[2214 rows x 4 columns]

In [108]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [109]:
close_px.tail(4)

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [110]:
def spx_corr(group):
    return group.corrwith(group["SPX"])

In [111]:
spx_corr(close_px)

AAPL    0.244478
MSFT    0.746871
XOM     0.528731
SPX     1.000000
dtype: float64

In [112]:
rets=close_px.pct_change().dropna()
rets

                AAPL      MSFT       XOM       SPX
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386
...              ...       ...       ...       ...
2011-10-10  0.051406  0.026286  0.036977  0.034125
2011-10-11  0.029526  0.002227 -0.000131  0.000544
2011-10-12  0.004747 -0.001481  0.011669  0.009795
2011-10-13  0.015515  0.008160 -0.010238 -0.002974
2011-10-14  0.033225  0.003311  0.022784  0.017380

[2213 rows x 4 columns]

In [113]:
def get_year(x):
    return x.year

by_year=rets.groupby(get_year)
by_year

In [114]:
list(by_year)

[(2003,
                  AAPL      MSFT       XOM       SPX
  2003-01-03  0.006757  0.001421  0.000684 -0.000484
  2003-01-06  0.000000  0.017975  0.024624  0.022474
  2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
  2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
  2003-01-09  0.008242  0.029094  0.021159  0.019386
  ...              ...       ...       ...       ...
  2003-12-24  0.030303 -0.003717  0.002080 -0.001807
  2003-12-26  0.018627  0.006063  0.005336  0.001691
  2003-12-29  0.017324  0.009272  0.013270  0.012401
  2003-12-30  0.006623  0.002297  0.002619  0.000144
  2003-12-31  0.004699 -0.005500  0.007837  0.002055

  [251 rows x 4 columns]),
 (2004,
                  AAPL      MSFT       XOM       SPX
  2004-01-02 -0.004677  0.002765 -0.008929 -0.003094
  2004-01-05  0.042293  0.025276  0.023249  0.012395
  2004-01-06 -0.003607  0.003586 -0.006816  0.001292
  2004-01-07  0.022624 -0.001340 -0.007149  0.002367
  2004-01-08  0.033628 -0.001342 -0.002592  0.004963
  ...              ...       ...       ...       ...
  2004-12-27 -0.013433 -0.006266 -0.021074 -0.004305
  2004-12-28  0.016149  0.003783  0.003399  0.007154
  2004-12-29  0.004051 -0.001675  0.001581 -0.000074
  2004-12-30  0.005587 -0.005034 -0.002029  0.000082
  2004-12-31 -0.006173 -0.001686  0.004519 -0.001343

  [252 rows x 4 columns]),
 (2005,
                  AAPL      MSFT       XOM       SPX
  2005-01-03 -0.017081  0.000845 -0.022717 -0.008119
  2005-01-04  0.010111  0.003797 -0.006904 -0.011671
  2005-01-05  0.008758 -0.002522 -0.005098 -0.003628
  2005-01-06  0.000930 -0.000843  0.012579  0.003506
  2005-01-07  0.072491 -0.002952 -0.006441 -0.001431
  ...              ...       ...       ...       ...
  2005-12-23 -0.009052  0.002096  0.000000  0.000426
  2005-12-27  0.011997 -0.006695 -0.021571 -0.009553
  2005-12-28 -0.008891 -0.002949  0.006675  0.001297
  2005-12-29 -0.028816 -0.004225 -0.000201 -0.002981
  2005-12-30  0.006158 -0.004667 -0.001206 -0.004887

  [252 rows x 4 columns]),
 (2006,
                  AAPL      MSFT       XOM       SPX
  2006-01-03  0.039783  0.026428  0.041046  0.016430
  2006-01-04  0.002943  0.004568  0.001739  0.003673
  2006-01-05 -0.007870  0.000827 -0.005016  0.000016
  2006-01-06  0.025813 -0.002891  0.019779  0.009399
  2006-01-09 -0.003277 -0.002071 -0.000570  0.003656
  ...              ...       ...       ...       ...
  2006-12-22 -0.008444 -0.011364 -0.005991 -0.005316
  2006-12-26 -0.008394  0.011865  0.008379  0.004352
  2006-12-27  0.000123  0.001099  0.011953  0.007015
  2006-12-28 -0.007974 -0.001464  0.004898 -0.001479
  2006-12-29  0.049091 -0.004032 -0.009031 -0.004513

  [251 rows x 4 columns]),
 (2007,
                  AAPL      MSFT       XOM       SPX
  2007-01-03 -0.012258  0.000000 -0.032981 -0.001199
  2007-01-04  0.022196 -0.001472 -0.018699  0.001228
  2007-01-05 -0.007121 -0.005898  0.007165 -0.006085
  2007-01-08  0.004938  0.010011 -0.008022  0.002220
  2007-01-09  0.083070  0.000734 -0.007782 -0.000517
  ...              ...       ...       ...       ...
  2007-12-24  0.025218  0.014432  0.002451  0.008077
  2007-12-26  0.000755  0.000889  0.012225  0.000809
  2007-12-27 -0.001910 -0.017471 -0.011962 -0.014282
  2007-12-28  0.006345  0.004219  0.014203  0.001504
  2007-12-31 -0.008757 -0.014406 -0.013889 -0.006852

  [251 rows x 4 columns]),
 (2008,
                  AAPL      MSFT       XOM       SPX
  2008-01-02 -0.016357 -0.010658 -0.001862 -0.014438
  2008-01-03  0.000462  0.004001  0.003382  0.000000
  2008-01-04 -0.076335 -0.027897 -0.018596 -0.024552
  2008-01-07 -0.013385  0.006623 -0.009356  0.003223
  2008-01-08 -0.035972 -0.033521 -0.012791 -0.018352
  ...              ...       ...       ...       ...
  2008-12-24 -0.015513 -0.005522  0.009113  0.005781
  2008-12-26  0.009055 -0.002221  0.018485  0.005356
  2008-12-29  0.009323 -0.008904  0.010806 -0.003873
  2008-12-30 -0.003695  0.020213  0.007264  0.024407
  2008-12-31 -0.010893  0.004953  0.015784  0.014158

  [253 rows x 4 columns]),
 (2009,
                  AAPL      MSFT       XOM       SPX
  2009-01-02  0.063269  0.046002  0.022773  0.031608
  2009-01-05  0.042204  0.009424 -0.000131 -0.004668
  2009-01-06 -0.016494  0.011411 -0.016374  0.007817
  2009-01-07 -0.021608 -0.060000 -0.025436 -0.030010
  2009-01-08  0.018569  0.031097  0.010659  0.003397
  ...              ...       ...       ...       ...
  2009-12-24  0.034339  0.002355  0.005818  0.005256
  2009-12-28  0.012294  0.005705  0.006241  0.001154
  2009-12-29 -0.011861  0.007007 -0.003480 -0.001401
  2009-12-30  0.012147 -0.013585 -0.001063  0.000195
  2009-12-31 -0.004300 -0.015788 -0.008511 -0.010050

  [252 rows x 4 columns]),
 (2010,
                  AAPL      MSFT       XOM       SPX
  2010-01-04  0.015565  0.015700  0.014102  0.016043
  2010-01-05  0.001729  0.000336  0.003930  0.003116
  2010-01-06 -0.015906 -0.006382  0.008582  0.000546
  2010-01-07 -0.001849 -0.010142 -0.003135  0.004001
  2010-01-08  0.006648  0.006831 -0.003893  0.002882
  ...              ...       ...       ...       ...
  2010-12-27  0.003337 -0.008279 -0.002641  0.000613
  2010-12-28  0.002433 -0.002178  0.005715  0.000771
  2010-12-29 -0.000553 -0.001455 -0.000693  0.001009
  2010-12-30 -0.005011 -0.004372 -0.000139 -0.001508
  2010-12-31 -0.003399  0.002195 -0.003329 -0.000191

  [252 rows x 4 columns]),
 (2011,
                  AAPL      MSFT       XOM       SPX
  2011-01-03  0.021732  0.002556  0.019624  0.011315
  2011-01-04  0.005219  0.004006  0.004641 -0.001313
  2011-01-05  0.008180 -0.003264 -0.002717  0.005007
  2011-01-06 -0.000808  0.029476  0.006540 -0.002123
  2011-01-07  0.007161 -0.007777  0.005414 -0.001845
  ...              ...       ...       ...       ...
  2011-10-10  0.051406  0.026286  0.036977  0.034125
  2011-10-11  0.029526  0.002227 -0.000131  0.000544
  2011-10-12  0.004747 -0.001481  0.011669  0.009795
  2011-10-13  0.015515  0.008160 -0.010238 -0.002974
  2011-10-14  0.033225  0.003311  0.022784  0.017380

  [199 rows x 4 columns])]

In [115]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [116]:
def corr_appl_msft(group):
    return group["AAPL"].corr(group["MSFT"])

In [117]:
corr_appl_msft(close_px)

0.5344802371958612

In [118]:
by_year.apply(corr_appl_msft)

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [119]:
by_year.apply(corr_appl_msft).mean()

0.42422560360343575

### Example: Group-Wise Linear Regression

In [120]:
import statsmodels.api as sm

In [121]:
def regress(data,yvar=None,xvars=None):
    Y=data[yvar]
    X=data[xvars]
    X["intercept"]=1
    result=sm.OLS(Y,X).fit()
    return result.params

In [122]:
regress(close_px,yvar="AAPL",xvars=["SPX"])

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_33236\1516053391.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X["intercept"]=1

SPX           0.145072
intercept   -46.216504
dtype: float64

In [123]:
by_year.apply(regress,yvar="AAPL",xvars=["SPX"])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

## 10.4: Group Transforms and "Unwrapped" GroupBys

In [124]:
df=pd.DataFrame({"key":["a","b","c"]*4,
                 "value":np.arange(12)})
df

   key  value
0    a      0
1    b      1
2    c      2
3    a      3
4    b      4
5    c      5
6    a      6
7    b      7
8    c      8
9    a      9
10   b     10
11   c     11

In [125]:
g=df.groupby("key")["value"]
list(g)

[('a',
  0    0
  3    3
  6    6
  9    9
  Name: value, dtype: int32),
 ('b',
  1      1
  4      4
  7      7
  10    10
  Name: value, dtype: int32),
 ('c',
  2      2
  5      5
  8      8
  11    11
  Name: value, dtype: int32)]

In [126]:
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [127]:
def get_mean(group):
    return group.mean()

In [128]:
g.transform(get_mean)

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [129]:
g.transform("sum")

0     18
1     22
2     26
3     18
4     22
5     26
6     18
7     22
8     26
9     18
10    22
11    26
Name: value, dtype: int32

In [130]:
g.transform("mean")

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [131]:
g.transform("min")

0     0
1     1
2     2
3     0
4     1
5     2
6     0
7     1
8     2
9     0
10    1
11    2
Name: value, dtype: int32

In [132]:
g.apply("min")

key
a    0
b    1
c    2
Name: value, dtype: int32

In [133]:
def times_two(group):
    return group*2

In [134]:
g.apply(times_two)

key
a    0      0
     3      6
     6     12
     9     18
b    1      2
     4      8
     7     14
     10    20
c    2      4
     5     10
     8     16
     11    22
Name: value, dtype: int32

In [135]:
g.transform(times_two)

0      0
1      2
2      4
3      6
4      8
5     10
6     12
7     14
8     16
9     18
10    20
11    22
Name: value, dtype: int32

In [136]:
def get_ranks(group):
    return group.rank(ascending=False)

In [137]:
g.transform(get_ranks)

0     4.0
1     4.0
2     4.0
3     3.0
4     3.0
5     3.0
6     2.0
7     2.0
8     2.0
9     1.0
10    1.0
11    1.0
Name: value, dtype: float64

In [138]:
g.apply(get_ranks)

key
a    0     4.0
     3     3.0
     6     2.0
     9     1.0
b    1     4.0
     4     3.0
     7     2.0
     10    1.0
c    2     4.0
     5     3.0
     8     2.0
     11    1.0
Name: value, dtype: float64

In [139]:
df

   key  value
0    a      0
1    b      1
2    c      2
3    a      3
4    b      4
5    c      5
6    a      6
7    b      7
8    c      8
9    a      9
10   b     10
11   c     11

In [140]:
(0+3+6+9)/4
(1+4+7+10)/4

4.5

5.5

In [141]:
4.5/np.std([0,3,6,9])
5.5/np.std([1,4,7,10])

1.3416407864998738

1.6397831834998458

In [142]:
list(g)

[('a',
  0    0
  3    3
  6    6
  9    9
  Name: value, dtype: int32),
 ('b',
  1      1
  4      4
  7      7
  10    10
  Name: value, dtype: int32),
 ('c',
  2      2
  5      5
  8      8
  11    11
  Name: value, dtype: int32)]

In [143]:
def normalize(x):
    return (x-x.mean())/x.std()

In [144]:
g.transform(normalize)

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [145]:
g.apply(normalize)

key
a    0    -1.161895
     3    -0.387298
     6     0.387298
     9     1.161895
b    1    -1.161895
     4    -0.387298
     7     0.387298
     10    1.161895
c    2    -1.161895
     5    -0.387298
     8     0.387298
     11    1.161895
Name: value, dtype: float64

In [146]:
a=[0,3,6,9]
b=[1,4,7,10]

(a-np.mean(a))/np.std(a)
(b-np.mean(b))/np.std(b)

array([-1.34164079, -0.4472136 ,  0.4472136 ,  1.34164079])

array([-1.34164079, -0.4472136 ,  0.4472136 ,  1.34164079])

In [147]:
g.transform("mean")

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [148]:
(df["value"]-g.transform("mean"))/g.transform("std")

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

## 10.5: Pivot Tables and Cross-Tabulation

In [149]:
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [150]:
tips.pivot_table(index=["day","smoker"],values=["size","tip","tip_pct","total_bill"])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [151]:
tips.pivot_table(index=["time","day"],columns="smoker",values=["tip_pct","size"])

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [152]:
tips.pivot_table(index=["time","day"],columns="smoker",values=["tip_pct","size"],margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [154]:
tips.pivot_table(index=["time","smoker"],columns="day",values="tip_pct",aggfunc=len,margins=True)

day             Fri   Sat   Sun  Thur  All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106
       Yes      9.0  42.0  19.0   NaN   70
Lunch  No       1.0   NaN   NaN  44.0   45
       Yes      6.0   NaN   NaN  17.0   23
All            19.0  87.0  76.0  62.0  244

In [156]:
tips.pivot_table(index=["time","smoker"],columns="day",values="tip_pct",aggfunc="count",margins=True)

day             Fri   Sat   Sun  Thur  All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106
       Yes      9.0  42.0  19.0   NaN   70
Lunch  No       1.0   NaN   NaN  44.0   45
       Yes      6.0   NaN   NaN  17.0   23
All            19.0  87.0  76.0  62.0  244

In [157]:
tips.pivot_table(index=["time","smoker"],columns="day",values="tip_pct",aggfunc=len,margins=True,fill_value=0)

day            Fri  Sat  Sun  Thur  All
time   smoker
Dinner No        3   45   57     1  106
       Yes       9   42   19     0   70
Lunch  No        1    0    0    44   45
       Yes       6    0    0    17   23
All             19   87   76    62  244

### Cross-Tabulations: Crosstab

In [158]:
from io import StringIO

In [159]:
data="""Sample Nationality Handedness
1 USA Right-handed
2 Japan Left-handed
3 USA Right-handed
4 Japan Right-handed
5 Japan Left-handed
6 Japan Right-handed
7 USA Right-handed
8 USA Left-handed
9 Japan Right-handed
10 USA Right-handed
"""

data=pd.read_table(StringIO(data),sep="\s+")
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [161]:
pd.crosstab(data["Nationality"],data["Handedness"],margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [162]:
pd.crosstab([tips["time"],tips["day"]],tips["smoker"],margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244